Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAK176.atdf
      <value-group caption="Reference Clock Request Status bit" name="REFO3CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO3CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO3CON__RSLP">
         <value caption="Reference Oscillator module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO3CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO3CON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFO3CON__ON">
         <value caption="Reference Oscillator module is enabled" name="" value="0x1" />
         <value caption="Reference Oscillator module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO3CON__RODIV">
         <value caption="REFO clock is Base clock frequency divided by 65534" name="" value="0x7fff" />
         <value caption="REFO clock is Base clock frequency divided by 6 (3*2)" name="" value="0x3" />
         <value caption="REFO clock is Base clock frequency divided by 4 (2*2)" name="" value="0x2" />
         <value caption="REFO clock is Base clock frequency divided by 2 (1*2)" name="" value="0x1" />
         <value caption="REFO is the same frequency as Base Clock (no divider)" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO4CON__ROSEL">
         <value name="Reserved" caption="" value="0xF"/>
         <value name="Reserved" caption="" value="0xE"/>
         <value name="Reserved" caption="" value="0xD"/>
         <value name="Reserved" caption="" value="0xC"/>
         <value name="Reserved" caption="" value="0xB"/>
         <value name="Reserved" caption="" value="0xA"/>
         <value name="BFRC" caption="Internal Backup FRC BFRC" value="0x9"/>
         <value name="REFCLKIx" caption="Reference Clock Input REFCLKIx" value="0x8"/>
         <value name="System PLL output" caption="System PLL Output SPLL" value="0x7"/>
         <value name="Reserved" caption="" value="0x6"/>
         <value name="Sosc" caption="Secondary Oscillator SOSC" value="0x5"/>
         <value name="LPRC" caption="Low Power Oscillator LPRC" value="0x4"/>
         <value name="FRC" caption="Internal Fast Oscillator FRC" value="0x3"/>
         <value name="Posc" caption="Primary Oscillator POSC" value="0x2"/>
         <value name="PBCLK1" caption="Peripheral Clock 1 PBCLK1" value="0x1"/>
         <value name="SYSCLK" caption="System clock SYSCLK" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO4CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO4CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO4CON__RSLP">
         <value caption="Reference Oscillator module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO4CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO4CON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFO4CON__ON">
         <value caption="Reference Oscillator module is enabled" name="" value="0x1" />
         <value caption="Reference Oscillator module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO4CON__RODIV">
         <value caption="REFO clock is Base clock frequency divided by 65534" name="" value="0x7fff" />
         <value caption="REFO clock is Base clock frequency divided by 6 (3*2)" name="" value="0x3" />
         <value caption="REFO clock is Base clock frequency divided by 4 (2*2)" name="" value="0x2" />
         <value caption="REFO clock is Base clock frequency divided by 2 (1*2)" name="" value="0x1" />
         <value caption="REFO is the same frequency as Base Clock (no divider)" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO5CON__ROSEL">
         <value name="Reserved" caption="" value="0xF"/>
         <value name="Reserved" caption="" value="0xE"/>
         <value name="Reserved" caption="" value="0xD"/>
         <value name="Reserved" caption="" value="0xC"/>
         <value name="Reserved" caption="" value="0xB"/>
         <value name="Reserved" caption="" value="0xA"/>
         <value name="BFRC" caption="Internal Backup FRC BFRC" value="0x9"/>
         <value name="REFCLKIx" caption="Reference Clock Input REFCLKIx" value="0x8"/>
         <value name="System PLL output" caption="System PLL Output SPLL" value="0x7"/>
         <value name="Reserved" caption="" value="0x6"/>
         <value name="Sosc" caption="Secondary Oscillator SOSC" value="0x5"/>
         <value name="LPRC" caption="Low Power Oscillator LPRC" value="0x4"/>
         <value name="FRC" caption="Internal Fast Oscillator FRC" value="0x3"/>
         <value name="Posc" caption="Primary Oscillator POSC" value="0x2"/>
         <value name="PBCLK1" caption="Peripheral Clock 1 PBCLK1" value="0x1"/>
         <value name="SYSCLK" caption="System clock SYSCLK" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO5CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO5CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO5CON__RSLP">
         <value caption="Reference Oscillator module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO5CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
