Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAK176.atdf
      <value-group caption="Control Buffer Empty Interrupt Enabled bit" name="SQI1INTEN__CONEMPTYIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Control Buffer Threshold Interrupt Enable bit" name="SQI1INTEN__CONTHRIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Buffer Descriptor Done Interrupt Enable bit" name="SQI1INTEN__BDDONEIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Buffer Descriptor Packet Complete Interrupt Enable bit" name="SQI1INTEN__PKTCOMPIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Bus Error Interrupt Enable bit" name="SQI1INTEN__DMAEIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Empty Interrupt Status bit" name="SQI1INTSTAT__TXEMPTYIF">
         <value caption="The transmit buffer is empty" name="" value="0x1" />
         <value caption="The transmit buffer has content" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Interrupt Status bit" name="SQI1INTSTAT__TXFULLIF">
         <value caption="The transmit buffer is full" name="" value="0x1" />
         <value caption="The transmit buffer is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Threshold Interrupt Status bit" name="SQI1INTSTAT__TXTHRIF">
         <value caption="Transmit buffer has more than TXINTTHR words of space available" name="" value="0x1" />
         <value caption="Transmit buffer has less than TXINTTHR words of space available" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Empty Interrupt Status bit" name="SQI1INTSTAT__RXEMPTYIF">
         <value caption="Receive buffer is empty" name="" value="0x1" />
         <value caption="Receive buffer is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Full Interrupt Status bit" name="SQI1INTSTAT__RXFULLIF">
         <value caption="Receive buffer is full" name="" value="0x1" />
         <value caption="Receive buffer is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Threshold Interrupt Status bit" name="SQI1INTSTAT__RXTHRIF">
         <value caption="Receive buffer has RXINTTHR or more words of space available" name="" value="0x1" />
         <value caption="Receive buffer has less than RXINTTHR words of space available" name="" value="0x0" />
      </value-group>
      <value-group caption="Control Buffer Full Interrupt Status bit" name="SQI1INTSTAT__CONFULLIF">
         <value caption="Control buffer is full" name="" value="0x1" />
         <value caption="Control buffer is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Control Buffer Empty Interrupt Status bit" name="SQI1INTSTAT__CONEMPTYIF">
         <value caption="Control buffer is empty" name="" value="0x1" />
         <value caption="Control buffer is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Control Buffer Threshold Interrupt Status bit" name="SQI1INTSTAT__CONTHRIF">
         <value caption="The control buffer has THRES or more words of space available" name="" value="0x1" />
         <value caption="The control buffer has less than THRES words of space available" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Buffer Descriptor Done Interrupt Status bit" name="SQI1INTSTAT__BDDONEIF">
         <value caption="DMA BD process is done" name="" value="0x1" />
         <value caption="DMA BD process is in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor Packet Complete Interrupt Status bit" name="SQI1INTSTAT__PKTCOMPIF">
         <value caption="DMA BD packet is complete" name="" value="0x1" />
         <value caption="DMA BD packet is in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Bus Error Interrupt Flag bit" name="SQI1INTSTAT__DMAEIF">
         <value caption="DMA bus error has occurred" name="" value="0x1" />
         <value caption="DMA bus error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Overflow Status bit" name="SQI1STAT2__TXOV">
         <value caption="Transmit Buffer overflow has occurred" name="" value="0x1" />
         <value caption="Transmit Buffer overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Underflow Status bit" name="SQI1STAT2__RXUN">
         <value caption="Receive Buffer Underflow has occurred" name="" value="0x1" />
         <value caption="Receive Buffer Underflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="SQID0 Status bit" name="SQI1STAT2__SQID0">
         <value caption="Data is present on SQID0" name="" value="0x1" />
         <value caption="Data is not present on SQID0" name="" value="0x0" />
      </value-group>
      <value-group caption="SQID1 Status bit" name="SQI1STAT2__SQID1">
         <value caption="Data is present on SQID1" name="" value="0x1" />
         <value caption="Data is not present on SQID1" name="" value="0x0" />
      </value-group>
      <value-group caption="SQID2 Status bit" name="SQI1STAT2__SQID2">
         <value caption="Data is present on SQID2" name="" value="0x1" />
         <value caption="Data is not present on SQID2" name="" value="0x0" />
      </value-group>
      <value-group caption="SQID3 Status bit" name="SQI1STAT2__SQID3">
         <value caption="Data is present on SQID3" name="" value="0x1" />
         <value caption="Data is not present on SQID3" name="" value="0x0" />
      </value-group>
      <value-group caption="Control IFO Space Available bits" name="SQI1STAT2__CONAVAIL">
         <value caption="32 bytes are available" name="" value="0x1f" />
         <value caption="31 bytes are available" name="" value="0x1e" />
         <value caption="1 byte is available" name="" value="0x1" />
         <value caption="No bytes are available" name="" value="0x0" />
      </value-group>
      <value-group caption="Current Command Status bits" name="SQI1STAT2__CMDSTAT">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Receive" name="" value="0x2" />
         <value caption="Transmit" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="SQI1BDCON__DMAEN">
         <value caption="DMA is enabled" name="" value="0x1" />
         <value caption="DMA is disabled" name="" value="0x0" />
      </value-group>
